In [1]:
import numpy as np

In [2]:
A = np.array([[1,2,3], [4,5,6]])
B = np.array([[7,8], [9,10], [11, 12]])

In [3]:
dot_product = np.dot(A, B)

In [4]:
print(dot_product)

[[ 58  64]
 [139 154]]

In [5]:
transpose_A = np.transpose(A)
transpose_product = np.dot(A, transpose_A)
print(transpose_product)

[[14 32]
 [32 77]]

In [6]:
import pandas as pd

In [9]:
titanic_df = pd.read_csv('titanic_train.csv')

In [10]:
print(type(titanic_df))

<class 'pandas.core.frame.DataFrame'>

In [12]:
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [13]:
value_counts = titanic_df['Pclass'].value_counts()

In [14]:
print(value_counts)

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [18]:
titanic_df['Age_0'] = 0
print(titanic_df.head(3))
titanic_drop_df = titanic_df.drop('Age_0', axis = 1)
print(titanic_drop_df.head(3))

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0

   Parch            Ticket     Fare Cabin Embarked  Age_0
0      0         A/5 21171   7.2500   NaN        S      0
1      0          PC 17599  71.2833   C85        C      0
2      0  STON/O2. 3101282   7.9250   NaN        S      0
   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S